In [21]:
import numpy as np
import pandas as pd

In [16]:
def mode(a, axis=0):
    scores = np.unique(np.ravel(a))       # get ALL unique values
    testshape = list(a.shape)
    testshape[axis] = 1
    oldmostfreq = np.zeros(testshape)
    oldcounts = np.zeros(testshape)

    for score in scores:
        template = (a == score)
        counts = np.expand_dims(np.sum(template, axis),axis)
        mostfrequent = np.where(counts > oldcounts, score, oldmostfreq)
        oldcounts = np.maximum(counts, oldcounts)
        oldmostfreq = mostfrequent

    return np.asscalar(mostfrequent)

In [17]:
a = np.array([1, 1, 1, -1, -1, 2, 2, 2, 2])

In [18]:
a

array([ 1,  1,  1, -1, -1,  2,  2,  2,  2])

In [19]:
mode(a)

2.0

In [22]:
raw_data = {'first_name': ['Jason', 'Molly', np.nan, np.nan, np.nan], 
        'nationality': ['USA', 'USA', 'France', 'UK', 'UK'], 
        'age': [42, 52, 36, 24, 70]}
df = pd.DataFrame(raw_data, columns = ['first_name', 'nationality', 'age'])
df

  first_name nationality  age
0      Jason         USA   42
1      Molly         USA   52
2        NaN      France   36
3        NaN          UK   24
4        NaN          UK   70

In [23]:
df[['first_name']]

  first_name
0      Jason
1      Molly
2        NaN
3        NaN
4        NaN

In [24]:
df['first_name']

0    Jason
1    Molly
2      NaN
3      NaN
4      NaN
Name: first_name, dtype: object

In [25]:
df.iloc[:, 0]

0    Jason
1    Molly
2      NaN
3      NaN
4      NaN
Name: first_name, dtype: object

In [31]:
df.age.shift(1) / df.age

0         NaN
1    0.807692
2    1.444444
3    1.500000
4    0.342857
Name: age, dtype: float64

In [32]:
df.age.shift(1)

0     NaN
1    42.0
2    52.0
3    36.0
4    24.0
Name: age, dtype: float64

In [36]:
list(df.columns).remove('age')

In [37]:
Xcols = list(df.columns)

In [38]:
Xcols.remove('age')

In [39]:
Xcols

['first_name', 'nationality']